In [1]:
import pandas as pd

In [2]:
jpyusd = pd.read_csv('../Data/Forex/JPYUSD.csv')

In [3]:
jpyusd.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2005-01-03,102.519997,103.430000,102.349998,102.739998,102.739998,0.0
1,2005-01-04,102.730003,104.739998,102.459999,104.339996,104.339996,0.0
2,2005-01-05,104.330002,104.970001,103.769997,103.930000,103.930000,0.0
3,2005-01-06,103.959999,105.129997,103.959999,104.889999,104.889999,0.0
4,2005-01-07,104.870003,105.110001,103.889999,104.889999,104.889999,0.0

In [4]:
jpyusd.shape

(4825, 7)

In [5]:
jpyusd.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
4820,2023-06-26,143.541000,143.682007,142.973007,143.541000,143.541000,0.0
4821,2023-06-27,143.460007,144.162994,143.292007,143.460007,143.460007,0.0
4822,2023-06-28,143.882004,144.595001,143.735992,143.882004,143.882004,0.0
4823,2023-06-29,144.389008,144.891998,144.138000,144.389008,144.389008,0.0
4824,2023-06-30,144.779999,145.033005,144.227997,144.779999,144.779999,0.0

Dropping Volume

In [6]:
jpyusd = jpyusd[["Date","Open","High","Low","Close", "Adj Close"]]

Checking if there are missing values

In [7]:
nan_mask = pd.isna(jpyusd).any(axis=1)

nan_values_df = jpyusd[nan_mask]
nan_values_df.shape

(28, 6)

Filling missing values with interpolate technique

In [8]:
jpyusd= jpyusd.interpolate(option='time')

In [9]:
jpyusd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4825 entries, 0 to 4824
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4825 non-null   object
 1   Open       4825 non-null   float64
 2   High       4825 non-null   float64
 3   Low        4825 non-null   float64
 4   Close      4825 non-null   float64
 5   Adj Close  4825 non-null   float64
dtypes: float64(5), object(1)
memory usage: 226.3+ KB

Set Date as index

In [10]:
jpyusd.Date = pd.to_datetime(jpyusd.Date)

In [11]:
jpyusd = jpyusd.set_index("Date")

In [12]:
jpyusd.index

DatetimeIndex(['2005-01-03', '2005-01-04', '2005-01-05', '2005-01-06',
               '2005-01-07', '2005-01-10', '2005-01-11', '2005-01-12',
               '2005-01-13', '2005-01-14',
               ...
               '2023-06-19', '2023-06-20', '2023-06-21', '2023-06-22',
               '2023-06-23', '2023-06-26', '2023-06-27', '2023-06-28',
               '2023-06-29', '2023-06-30'],
              dtype='datetime64[ns]', name='Date', length=4825, freq=None)

In [13]:
jpyusd.head()

                  Open        High         Low       Close   Adj Close
Date
2005-01-03  102.519997  103.430000  102.349998  102.739998  102.739998
2005-01-04  102.730003  104.739998  102.459999  104.339996  104.339996
2005-01-05  104.330002  104.970001  103.769997  103.930000  103.930000
2005-01-06  103.959999  105.129997  103.959999  104.889999  104.889999
2005-01-07  104.870003  105.110001  103.889999  104.889999  104.889999

In [14]:
jpyusd.tail()

                  Open        High         Low       Close   Adj Close
Date
2023-06-26  143.541000  143.682007  142.973007  143.541000  143.541000
2023-06-27  143.460007  144.162994  143.292007  143.460007  143.460007
2023-06-28  143.882004  144.595001  143.735992  143.882004  143.882004
2023-06-29  144.389008  144.891998  144.138000  144.389008  144.389008
2023-06-30  144.779999  145.033005  144.227997  144.779999  144.779999

In [15]:
missing_dates  = pd.date_range(
  start="2005-02-22", end="2023-06-30").difference(jpyusd.index)

In [16]:
missing_dates

DatetimeIndex(['2005-02-26', '2005-02-27', '2005-03-05', '2005-03-06',
               '2005-03-12', '2005-03-13', '2005-03-19', '2005-03-20',
               '2005-03-26', '2005-03-27',
               ...
               '2023-05-27', '2023-05-28', '2023-06-03', '2023-06-04',
               '2023-06-10', '2023-06-11', '2023-06-17', '2023-06-18',
               '2023-06-24', '2023-06-25'],
              dtype='datetime64[ns]', length=1914, freq=None)

Filling the missing dates

In [17]:
complete_date_range =  pd.date_range(start='2005-01-03', end='2023-06-30', freq='D')

In [18]:
complete_forex_data = pd.DataFrame(index=complete_date_range)

In [19]:
complete_forex_data = complete_forex_data.merge(jpyusd, left_index=True, right_index=True, how='left')

In [20]:
complete_forex_data.head(10)

                  Open        High         Low       Close   Adj Close
2005-01-03  102.519997  103.430000  102.349998  102.739998  102.739998
2005-01-04  102.730003  104.739998  102.459999  104.339996  104.339996
2005-01-05  104.330002  104.970001  103.769997  103.930000  103.930000
2005-01-06  103.959999  105.129997  103.959999  104.889999  104.889999
2005-01-07  104.870003  105.110001  103.889999  104.889999  104.889999
2005-01-08         NaN         NaN         NaN         NaN         NaN
2005-01-09         NaN         NaN         NaN         NaN         NaN
2005-01-10  104.680000  104.800003  104.070000  104.169998  104.169998
2005-01-11  104.180000  104.260002  103.120003  103.419998  103.419998
2005-01-12  103.419998  103.529999  102.180000  102.440002  102.440002

In [21]:
# Reset the index and rename the 'forex_rate' column if needed
complete_forex_data.reset_index(inplace=True)
complete_forex_data.rename(columns={'index': 'Date'}, inplace=True)

In [22]:
complete_forex_data.head()

        Date        Open        High         Low       Close   Adj Close
0 2005-01-03  102.519997  103.430000  102.349998  102.739998  102.739998
1 2005-01-04  102.730003  104.739998  102.459999  104.339996  104.339996
2 2005-01-05  104.330002  104.970001  103.769997  103.930000  103.930000
3 2005-01-06  103.959999  105.129997  103.959999  104.889999  104.889999
4 2005-01-07  104.870003  105.110001  103.889999  104.889999  104.889999

In [23]:
complete_forex_data.set_index('Date', inplace=True)

In [24]:
complete_forex_data.index

DatetimeIndex(['2005-01-03', '2005-01-04', '2005-01-05', '2005-01-06',
               '2005-01-07', '2005-01-08', '2005-01-09', '2005-01-10',
               '2005-01-11', '2005-01-12',
               ...
               '2023-06-21', '2023-06-22', '2023-06-23', '2023-06-24',
               '2023-06-25', '2023-06-26', '2023-06-27', '2023-06-28',
               '2023-06-29', '2023-06-30'],
              dtype='datetime64[ns]', name='Date', length=6753, freq=None)

The new dates have no values. Saturdays and Holidays take the value of the previos date (backward filling). Sundays take the values of the next date (forward filling).

In [25]:

# Forward fill (ffill) for Saturdays
complete_forex_data = complete_forex_data.fillna(method='ffill', limit=1)

# Backward fill (bfill) for Sundays
complete_forex_data = complete_forex_data.fillna(method='bfill', limit=1)

In [26]:
complete_forex_data.head(10)

                  Open        High         Low       Close   Adj Close
Date
2005-01-03  102.519997  103.430000  102.349998  102.739998  102.739998
2005-01-04  102.730003  104.739998  102.459999  104.339996  104.339996
2005-01-05  104.330002  104.970001  103.769997  103.930000  103.930000
2005-01-06  103.959999  105.129997  103.959999  104.889999  104.889999
2005-01-07  104.870003  105.110001  103.889999  104.889999  104.889999
2005-01-08  104.870003  105.110001  103.889999  104.889999  104.889999
2005-01-09  104.680000  104.800003  104.070000  104.169998  104.169998
2005-01-10  104.680000  104.800003  104.070000  104.169998  104.169998
2005-01-11  104.180000  104.260002  103.120003  103.419998  103.419998
2005-01-12  103.419998  103.529999  102.180000  102.440002  102.440002

Checking for missing values

In [27]:
nan_mask = pd.isna(complete_forex_data).any(axis=1)

nan_values_df = complete_forex_data[nan_mask]
nan_values_df.shape

(0, 5)

In [28]:
complete_forex_data.to_csv("prepared_Forex_JPYUSD.csv", index="None")